full Plan change output with some things redacted
```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_db_instance.bchen must be replaced
-/+ resource "aws_db_instance" "bchen" {
      ~ address                               = "<REDACTED>"" -> (known after apply)
        allocated_storage                     = 50
        allow_major_version_upgrade           = false
        apply_immediately                     = true
      ~ arn                                   = "<REDACTED>" -> (known after apply)
        auto_minor_version_upgrade            = true
      ~ availability_zone                     = "us-east-1a" -> (known after apply)
        backup_retention_period               = 1
        backup_window                         = "07:00-07:30"
      ~ ca_cert_identifier                    = "rds-ca-2019" -> (known after apply)
      + character_set_name                    = (known after apply)
        copy_tags_to_snapshot                 = true
        db_subnet_group_name                  = "infra-uat-db-subnets"
        deletion_protection                   = false
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "<REDACTED>" -> (known after apply)
        engine                                = "postgres"
        engine_version                        = "11.4"
      ~ hosted_zone_id                        = "<REDACTED>" -> (known after apply)
        iam_database_authentication_enabled   = true
      ~ id                                    = "bchen" -> (known after apply)
        identifier                            = "bchen"
      + identifier_prefix                     = (known after apply)
        instance_class                        = "db.m5.large"
      - iops                                  = 0 -> null
      + kms_key_id                            = (known after apply)
      ~ license_model                         = "postgresql-license" -> (known after apply)
        maintenance_window                    = "sun:08:00-sun:10:00"
      - max_allocated_storage                 = 0 -> null
        monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
        multi_az                              = false
        name                                  = "postgres"
      ~ option_group_name                     = "default:postgres-11" -> (known after apply)
      ~ parameter_group_name                  = "default.postgres11" -> (known after apply)
        password                              = (sensitive value)
        performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
        port                                  = 5432
        publicly_accessible                   = false
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "REDACTED"" -> (known after apply)
      - security_group_names                  = [] -> null
        skip_final_snapshot                   = true
      ~ snapshot_identifier                   = "arn:aws:rds:us-east-1:<REDACTED>:snapshot:<REDACTED>" -> "arn:aws:rds:us-east-1:<REDACTED>:snapshot:<REDACTED>" # forces replacement
      ~ status                                = "available" -> (known after apply)
      - storage_encrypted                     = false -> null
        storage_type                          = "gp2"
      - tags                                  = {} -> null
      + timezone                              = (known after apply)
        username                              = "postgres"
        vpc_security_group_ids                = [
            "sg-<REDACTED>",
            "sg-<REDACTED>",
        ]
    }

  # module.postgres.aws_db_instance.postgres must be replaced
+/- resource "aws_db_instance" "postgres" {
      ~ address                               = "<REDACTED>" -> (known after apply)
        allocated_storage                     = 50
        allow_major_version_upgrade           = false
        apply_immediately                     = true
      ~ arn                                   = "arn:aws:rds:us-east-1:<REDACTED>:db:<REDACTED>" -> (known after apply)
        auto_minor_version_upgrade            = true
      ~ availability_zone                     = "us-east-1c" -> (known after apply)
        backup_retention_period               = 7
        backup_window                         = "07:00-07:30"
        ca_cert_identifier                    = "rds-ca-2019"
      + character_set_name                    = (known after apply)
        copy_tags_to_snapshot                 = true
        db_subnet_group_name                  = "infra-uat-db-subnets"
        deletion_protection                   = false
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "<REDACTED>" -> (known after apply)
        engine                                = "postgres"
        engine_version                        = "11.4"
        final_snapshot_identifier             = "<REDACTED>"
      ~ hosted_zone_id                        = "<REDACTED>" -> (known after apply)
        iam_database_authentication_enabled   = true
      ~ id                                    = "<REDACTED>" -> (known after apply)
        identifier                            = "<REDACTED>"
      + identifier_prefix                     = (known after apply)
        instance_class                        = "db.m5.large"
        iops                                  = 0
      + kms_key_id                            = (known after apply)
      ~ license_model                         = "postgresql-license" -> (known after apply)
        maintenance_window                    = "sun:08:00-sun:10:00"
      - max_allocated_storage                 = 0 -> null
        monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
        multi_az                              = false
        name                                  = "postgres"
      ~ option_group_name                     = "default:postgres-11" -> (known after apply)
      ~ parameter_group_name                  = "default.postgres11" -> (known after apply)
        password                              = (sensitive value)
        performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
        port                                  = 5432
        publicly_accessible                   = false
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "<REDACTED>" -> (known after apply)
      - security_group_names                  = [] -> null
        skip_final_snapshot                   = true
      ~ snapshot_identifier                   = "arn:aws:rds:us-east-1:<REDACTED>:snapshot:<REDACTED"" -> "arn:aws:rds:us-east-1:<REDACTED>:snapshot:<REDACTED>" # forces replacement
      ~ status                                = "available" -> (known after apply)
      - storage_encrypted                     = false -> null
        storage_type                          = "gp2"
        tags                                  = {
            "sr_app"    = "<REDACTED>"
            "sr_env"    = "<REDACTED>"
            "sr_group"  = "<REDACTED>"
            "sr_org"    = "<REDACTED>"
            "sr_region" = "<REDACTED>"
        }
      + timezone                              = (known after apply)
        username                              = "postgres"
        vpc_security_group_ids                = [
            "sg-<REDACTED>",
            "sg-<REDACTED>",
        ]
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```